data1 = [
    ["오래되다", "быть старым, давним", "o-rae-doe-da"],
    ["호수", "озеро", "ho-su"],
    ["맥주", "пиво", "maek-ju"],
    ["벚꽃", "цветение вишни", "beot-kkot"],
    ["한강", "река Ханган", "han-gang"],
    ["해산물", "морепродукты", "hae-san-mul"],
    ["생선회", "сашими, сырая рыба", "saeng-seon-hoe"],
    ["절(사원)", "буддийский храм", "jeol (sa-won)"],
    ["박물관", "музей", "bak-mul-gwan"],
    ["건물", "здание", "geon-mul"],
    ["높다", "высокий", "nop-da"],
    ["많다", "много", "man-ta"],
    ["복잡하다", "сложный; переполненный", "bok-jap-ha-da"],
    ["야경", "ночной пейзаж", "ya-gyeong"],
    ["아름답다", "красивый", "a-reum-dap-da"],
    ["교통", "транспорт", "gyo-tong"],
    ["편리하다", "удобный, практичный", "pyeon-ri-ha-da"],
    ["한적하다", "спокойный, безлюдный", "han-jeok-ha-da"],
    ["깨끗하다", "чистый", "kkae-kkeut-ha-da"],
    ["조용하다", "тихий", "jo-yong-ha-da"],
    ["낮다", "низкий", "nat-da"],
    ["특히", "особенно, в особенности", "teuk-hi"],
    ["관광지", "туристическое место", "gwan-gwang-ji"],
    ["섬", "остров", "seom"]
]

data2 = [
    ["청소하다", "убирать", "cheong-so-ha-da"],
    ["빨래하다", "стирать бельё", "ppal-lae-ha-da"],
    ["요리하다", "готовить еду (профессионально)", "yo-ri-ha-da"],
    ["책장을 정리하다", "наводить порядок на книжной полке", "chaek-jjang-eul jeong-ri-ha-da"],
    ["방을 치우다", "убирать комнату", "bang-eul chi-u-da"],
    ["방을 쓸다", "подметать комнату", "bang-eul sseul-da"],
    ["방을 닦다", "мыть комнату", "bang-eul dak-tta"],
    ["청소기를 돌리다", "пылесосить", "cheong-so-gi-reul dol-li-da"],
    ["쓰레기를 버리다", "выбрасывать мусор", "sseu-re-gi-reul beo-ri-da"],
    ["분리수거를 하다", "сортировать мусор", "bun-ri-su-geo-reul ha-da"],
    ["빨래를 널다", "развешивать бельё", "ppal-lae-reul neol-da"],
    ["빨래를 개다", "складывать бельё", "ppal-lae-reul kae-da"],
    ["세탁기를 돌리다", "включать стиральную машину", "se-tak-gi-reul dol-li-da"],
    ["다림질을 하다", "гладить", "da-rim-jil-eul ha-da"],
    ["손빨래를 하다", "стирать вручную", "son-ppal-lae-reul ha-da"],
    ["음식을 만들다", "готовить еду (повседневно)", "eum-sik-eul man-deul-da"],
    ["설거지하다", "мыть посуду", "seol-geo-ji-ha-da"],
    ["퇴근", "уход с работы, возвращение домой", "toe-geun"],
    ["잊다", "забывать", "it-da"],
    ["장 보다", "ходить за продуктами", "jang bo-da"],
    ["걸레질", "протирать тряпкой/шваброй", "geol-le-jil"],
    ["음식물 쓰레기", "пищевые отходы", "eum-sik-mul sseu-re-gi"],
    ["급한 일이 생기다", "появилось срочное дело", "geu-pan il-i saeng-gi-da"]
]

data3 = [
    ["모자를 쓰다", "носить (на голове, лице)", "sseu-da"],
    ["모자", "шапка, кепка", "mo-ja"],
    ["헬멧", "шлем", "hel-met"],
    ["안전모", "защитный шлем/каска", "an-jeon-mo"],
    ["안경", "очки", "an-gyeong"],
    ["선글라스", "солнечные очки", "seon-geul-ra-seu"],
    ["신다", "надевать (на ноги)", "sin-da"],
    ["운동화", "кроссовки", "un-dong-hwa"],
    ["샌들", "сандалии", "saen-deul"],
    ["구두", "туфли", "gu-du"],
    ["부츠", "сапоги", "bu-cheu"],
    ["슬리퍼", "тапочки", "seul-li-peo"],
    ["작업화", "рабочая обувь", "ja-geop-hwa"],
    ["치수", "размер (одежды/обуви)", "chi-su"],
    ["잘 맞다", "хорошо сидеть (подходить)", "jal mat-da"],
    ["굽이 높다", "каблук высокий", "gub-i nop-da"],
    ["입다", "надевать (одежду)", "ip-da"],
    ["티셔츠", "футболка", "ti-syeo-cheu"],
    ["청바지", "джинсы", "cheong-ba-ji"],
    ["셔츠", "рубашка", "syeo-cheu"],
    ["치마", "юбка", "chi-ma"],
    ["블라우스", "блузка", "beul-ra-u-seu"],
    ["원피스", "платье", "won-pi-seu"],
    ["코트", "пальто", "ko-teu"],
    ["점퍼", "куртка", "jeom-peo"],
    ["바지", "брюки", "ba-ji"],
    ["조끼", "жилет", "jo-kki"],
    ["하다", "носить (аксессуары)", "ha-da"],
    ["스카프", "шарф, платок", "seu-ka-peu"],
    ["귀걸이", "серьги", "gwi-geo-ri"],
    ["목도리", "тёплый шарф", "mok-do-ri"],
    ["목걸이", "ожерелье", "mok-geo-ri"],
    ["길이", "длина", "gil-i"],
    ["짧다", "короткий", "jjalb-da"],
    ["길다", "длинный", "gil-da"],
    ["편하다", "удобный, комфортный", "pyeon-ha-da"],
    ["마음에 들다", "нравиться", "ma-eum-e deul-da"],
    ["작업복", "рабочая одежда", "ja-geop-bok"],
    ["시원하다", "прохладный, освежающий", "si-won-ha-da"],
    ["땀", "пот", "ttam"],
    ["마르다", "сухой; худой", "ma-reu-da"],
    ["주머니", "карман", "ju-meo-ni"]
]

data4 = [
    ["전화를 걸다", "звонить", "jeon-hwa-reul geol-da"],
    ["전화를 받다", "отвечать на звонок", "jeon-hwa-reul bat-da"],
    ["전화를 끊다", "заканчивать звонок", "jeon-hwa-reul kkeun-ta"],
    ["문자를 보내다", "отправлять сообщение", "mun-ja-reul bo-nae-da"],
    ["문자를 받다", "получать сообщение", "mun-ja-reul bat-da"],
    ["문자를 지우다", "удалять сообщение", "mun-ja-reul ji-u-da"],
    ["전화를 바꾸다", "передать трубку", "jeon-hwa-reul ba-kku-da"],
    ["국제 전화를 하다", "звонить за границу", "guk-je jeon-hwa-reul ha-da"],
    ["영상 통화를 하다", "совершать видеозвонок", "yeong-sang tong-hwa-reul ha-da"],
    ["여보세요?", "алло?", "yeo-bo-se-yo?"],
    ["전화를 잘못 걸었어요", "я ошибся номером", "jeon-hwa-reul jal-mot geo-reo-sseo-yo"],
    ["통화 중이에요", "занято (по телефону)", "tong-hwa jung-i-e-yo"],
    ["매너 모드로 하세요 / 진동으로 하세요", "переведите в беззвучный / виброрежим", "mae-neo mo-deu-ro ha-se-yo / jin-dong-eu-ro ha-se-yo"],
    ["휴대 전화 배터리가 없어요", "телефон разряжен", "hyu-dae jeon-hwa bae-te-ri-ga eop-seo-yo"],
    ["답장이 없어요", "нет ответа", "dap-jang-i eop-seo-yo"],
    ["전화번호가 몇 번이에요?", "какой номер телефона?", "jeon-hwa-beon-ho-ga myeot beon-i-e-yo?"],
    ["전화 왔어요", "был звонок", "jeon-hwa wat-seo-yo"],
    ["지금 안 계세요", "сейчас его/её нет", "ji-geum an gye-se-yo"],
    ["혹시", "вдруг, может быть", "hok-ssi"],
    ["걱정이 되다", "волноваться", "geok-jeong-i doe-da"],
    ["구경하다", "осматривать, смотреть", "gu-gyeong-ha-da"],
    ["시험 범위", "объём экзамена", "si-heom beom-wi"]
]

data5 = [
    ["열이 나다", "повышается температура", "yeol-i na-da"],
    ["콧물이 나다", "течёт из носа", "kot-mul-i na-da"],
    ["머리가 아프다", "болит голова", "meo-ri-ga a-peu-da"],
    ["기침을 하다", "кашлять", "gi-chim-eul ha-da"],
    ["이가 아프다", "болит зуб", "i-ga a-peu-da"],
    ["목이 붓다", "опухло горло", "mok-i but-da"],
    ["배가 아프다", "болит живот", "bae-ga a-peu-da"],
    ["설사를 하다", "страдать диареей", "seol-sa-reul ha-da"],
    ["부러지다", "сломаться (кость)", "bu-reo-ji-da"],
    ["다치다", "пораниться", "da-chi-da"],
    ["해열제", "жаропонижающее", "hae-yeol-je"],
    ["두통약", "таблетки от головной боли", "du-tong-yak"],
    ["감기약", "лекарство от простуды", "gam-gi-yak"],
    ["소화제", "лекарство для пищеварения", "so-hwa-je"],
    ["파스", "разогревающий пластырь", "pa-seu"],
    ["밴드", "лейкопластырь", "baen-deu"],
    ["붙이다", "приклеивать", "bu-chi-da"],
    ["소독약", "антисептик", "so-dok-yak"],
    ["연고", "мазь", "yeon-go"],
    ["바르다", "мазать", "ba-reu-da"],
    ["용법", "способ применения", "yong-beop"],
    ["회", "раз (приём лекарства)", "hoe"],
    ["분", "доза (доля лекарства)", "bun"],
    ["식전", "до еды", "sik-jeon"],
    ["식후", "после еды", "sik-hu"],
    ["댓글", "комментарий (в интернете)", "daet-geul"]
]

data6 = [
    ["기분이 좋다", "настроение хорошее", "gi-bun-i jo-ta"],
    ["기쁘다", "радостный", "gi-ppeu-da"],
    ["행복하다", "счастливый", "haeng-bok-ha-da"],
    ["신나다", "в восторге", "sin-na-da"],
    ["반갑다", "приятно (встретиться)", "ban-gap-da"],
    ["즐겁다", "весёлый, радостный", "jeul-geop-da"],
    ["기분이 안 좋다", "настроение плохое", "gi-bun-i an jo-ta"],
    ["슬프다", "грустный", "seul-peu-da"],
    ["외롭다", "одинокий", "oe-rop-da"],
    ["화나다", "злиться", "hwa-na-da"],
    ["걱정되다", "волноваться, беспокоиться", "geok-jeong-doe-da"],
    ["짜증나다", "раздражаться", "jja-jeung-na-da"],
    ["답답하다", "тяжело на душе; душно", "dap-dap-ha-da"]
]

data7 = [
    ["집들이", "новоселье", "jip-deul-i"],
    ["휴지", "туалетная бумага; салфетка", "hyu-ji"],
    ["세제", "моющее средство", "se-je"],
    ["손님을 맞이하다", "встречать гостя", "son-nim-eul ma-ji-ha-da"],
    ["음식을 차리다", "накрывать на стол", "eum-sik-eul cha-ri-da"],
    ["선물을 가져가다", "приносить подарок", "seon-mul-eul ga-jyeo-ga-da"],
    ["돌잔치", "праздник первого дня рождения ребёнка", "dol-jan-chi"],
    ["장난감", "игрушка", "jang-nan-kkam"],
    ["금반지", "золотое кольцо", "geum-ban-ji"],
    ["손님을 대접하다", "угощать гостя", "son-nim-eul dae-jeop-ha-da"],
    ["미리 연락하다", "связываться заранее", "mi-ri yeon-rak-ha-da"],
    ["약속 시간을 정하다", "назначать время встречи", "yak-sok si-gan-eul jeong-ha-da"],
    ["늦지 않게 도착하다", "прибывать без опоздания", "neut-ji an-ge do-chak-ha-da"],
    ["노크를 하다", "стучать (в дверь)", "no-keu-reul ha-da"],
    ["인사를 나누다", "обмениваться приветствиями", "in-sa-reul na-nu-da"],
    ["명함을 건네다", "передавать визитку", "myeong-ham-eul geon-ne-da"],
    ["방학", "каникулы", "bang-hak"],
    ["개학", "начало учебного семестра", "gae-hak"],
    ["원어민", "носитель языка", "won-eo-min"],
    ["확인", "подтверждение", "hwak-in"],
    ["답장", "ответ (письменный)", "dap-jang"],
    ["교장", "директор школы", "gyo-jang"]
]

data8 = [
    ["과정명", "название курса", "gwa-jeong-myeong"],
    ["신청 기간", "срок подачи заявки", "sin-cheong gi-gan"],
    ["과정 기간", "срок проведения курса", "gwa-jeong gi-gan"],
    ["요일", "день недели", "yo-il"],
    ["단계", "этап, уровень", "dan-gye"],
    ["이수", "завершение курса", "i-su"],
    ["출석", "посещаемость", "chul-seok"],
    ["이상", "выше, свыше", "i-sang"],
    ["평가", "оценка", "pyeong-ga"],
    ["합격", "сдача экзамена", "hap-gyeok"],
    ["불합격", "провал на экзамене", "bul-hap-gyeok"],
    ["재응시", "повторная сдача экзамена", "jae-eung-si"],
    ["재수료", "повторное прохождение курса", "jae-su-ryo"],
    ["승급", "повышение уровня", "seung-geup"]
]

data9 = [
    ["재료가 신선하다", "ингредиенты свежие", "jae-ryo-ga sin-seon-ha-da"],
    ["국물이 시원하다", "бульон освежающий (приятный)", "guk-mul-i si-won-ha-da"],
    ["달다", "сладкий", "dal-da"],
    ["쓰다", "горький", "sseu-da"],
    ["시다", "кислый", "si-da"],
    ["짜다", "солёный", "jja-da"],
    ["매콤하다", "остренький", "mae-kom-ha-da"],
    ["짭짤하다", "слегка солёный", "jap-jjal-ha-da"],
    ["싱겁다", "пресный", "sing-geop-da"],
    ["조미료가 들어가다", "содержать приправы", "jo-mi-ryo-ga deu-reo-ga-da"],
    ["달콤하다", "сладковатый", "dal-kom-ha-da"],
    ["새콤하다", "кисловатый", "sae-kom-ha-da"],
    ["자리가 없다", "нет мест", "ja-ri-ga eop-da"],
    ["맛집으로 유명하다", "известен как вкусное место", "mat-jib-eu-ro yu-myeong-ha-da"],
    ["줄을 서다", "стоять в очереди", "jul-eul seo-da"],
    ["양이 많다", "порция большая", "yang-i man-ta"],
    ["밑반찬이 많이 나오다", "много подают закусок", "mit-ban-chan-i man-i na-o-da"],
    ["분위기가 좋다", "атмосфера хорошая", "bun-wi-gi-ga jo-ta"],
    ["서비스가 좋다", "обслуживание хорошее", "seo-bi-seu-ga jo-ta"],
    ["칸막이가 있다", "есть перегородка", "kan-ma-gi-ga it-da"],
    ["찾아가다", "идти (куда-то, чтобы навестить)", "cha-ja-ga-da"]
]

data10 = [
    ["육교", "пешеходный мост", "yuk-gyo"],
    ["신호등", "светофор", "sin-ho-deung"],
    ["횡단보도", "пешеходный переход", "hoeng-dan-bo-do"],
    ["버스 정류장", "автобусная остановка", "beo-seu jeong-ryu-jang"],
    ["사거리", "перекресток", "sa-geo-ri"],
    ["지하철역", "станция метро", "ji-ha-cheol-yeok"],
    ["맞은편에 있다", "быть напротив", "mat-eun-pyeon-e it-da"],
    ["쪽 가다", "идти прямо", "jjok ga-da"],
    ["똑바로 가다", "идти строго прямо", "ttok-ba-ro ga-da"],
    ["왼쪽으로 가다", "идти налево", "oen-jjok-eu-ro ga-da"],
    ["오른쪽으로 가다", "идти направо", "o-reun-jjok-eu-ro ga-da"],
    ["버스를 타다", "садиться на автобус", "beo-seu-reul ta-da"],
    ["교통 카드로 요금을 내다", "платить проезд транспортной картой", "gyo-tong ka-deu-ro yo-geum-eul nae-da"],
    ["버스에서 내리다", "выходить из автобуса", "beo-seu-e-seo nae-ri-da"],
    ["지하철로 갈아타다", "пересаживаться на метро", "ji-ha-cheol-lo ga-ra-ta-da"],
    ["1번 출구로 나가다", "выходить через выход №1", "il-beon chul-gu-ro na-ga-da"],
    ["회사가 보이다", "виднеться (быть видимым) компания", "hoe-sa-ga bo-i-da"],
    ["기억하다", "помнить", "gi-eok-ha-da"],
    ["방법", "способ", "bang-beop"],
    ["편의점", "магазин у дома", "pyeon-ui-jeom"],
    ["아파트", "многоквартирный дом", "a-pa-teu"]
]

data11 = [
    ["고향에 내려가다", "поехать в родной город", "go-hyang-e nae-ryeo-ga-da"],
    ["친척", "родственник", "chin-cheok"],
    ["가족이 모이다", "собираться семьёй", "ga-jok-i mo-i-da"],
    ["서로 안부를 묻다", "спрашивать друг у друга о делах", "seo-ro an-bu-reul mut-da"],
    ["성묘를 하다", "посещать могилу предков", "seong-myo-reul ha-da"],
    ["차례를 지내다", "проводить поминальный обряд", "cha-rye-reul ji-nae-da"],
    ["윷놀이", "традиционная игра 'Ютнори'", "yut-no-ri"],
    ["연날리기", "запускать воздушного змея", "yeon-nal-li-gi"],
    ["제기차기", "игра в 'толчок ногой' (джеги)", "je-gi-cha-gi"],
    ["설날(음력 1월 1일)", "Новый год по лунному календарю", "seol-nal (eum-ryeok il-wol il-il)"],
    ["세배를 하다", "делать новогодний поклон старшим", "se-bae-reul ha-da"],
    ["세배를 받다", "получать новогодний поклон", "se-bae-reul bat-da"],
    ["떡국", "суп с рисовыми клецками", "tteok-guk"],
    ["추석(음력 8월 15일)", "Праздник урожая (Чусок)", "chu-seok (eum-ryeok pal-wol sip-o-il)"],
    ["송편을 빚다", "лепить рисовые пирожки сонпхён", "song-pyeon-eul bit-da"],
    ["모이다", "собираться", "mo-i-da"],
    ["소원을 빌다", "загадать желание", "so-won-eul bil-da"],
    ["대표적", "представительный, типичный", "dae-pyo-jeok"],
    ["덕담", "добрые слова, пожелания", "deok-dam"],
    ["한 해", "один год", "han hae"],
    ["농사", "земледелие", "nong-sa"],
    ["조상", "предки", "jo-sang"],
]

data12 = [
    ["당황하다", "растеряться", "dang-hwang-ha-da"],
    ["창피하다", "стыдно", "chang-pi-ha-da"],
    ["무섭다", "страшно", "mu-seop-da"],
    ["속상하다", "огорчаться", "sok-sang-ha-da"],
    ["우울하다", "тосковать, унывать", "u-ul-ha-da"],
    ["그립다", "скучать", "geu-rip-da"],
    ["반말을 하다", "разговаривать неформально", "ban-mal-eul ha-da"],
    ["이름을 부르다", "называть по имени", "i-reum-eul bu-reu-da"],
    ["한 손으로 물건을 드리다", "передавать предмет одной рукой", "han son-eu-ro mul-geon-eul deu-ri-da"],
    ["못 알아듣다", "не понять на слух", "mot a-ra-deut-da"],
    ["글자를 잘못 읽다", "неправильно прочитать буквы", "geul-ja-reul jal-mot ik-da"],
    ["잘못 발음하다", "неправильно произносить", "jal-mot ba-reum-ha-da"],
    ["신발을 신고 들어가다", "заходить в обуви", "sin-bal-eul sin-go deu-reo-ga-da"],
    ["노약자석에 앉다", "сидеть на месте для пожилых", "no-yak-ja-seok-e an-da"],
    ["사람을 잘못 보다", "принять человека за другого", "sa-ram-eul jal-mot bo-da"],
    ["단말기", "терминал", "dan-mal-gi"],
    ["대다", "прикладывать", "dae-da"],
    ["환승", "пересадка", "hwan-seung"],
    ["하차", "выход (из транспорта)", "ha-cha"],
    ["잔액", "остаток (средств)", "jan-aek"],
    ["동료", "коллега", "dong-ryo"],
]

data13 = [
    ["편지를 보내다", "отправлять письмо", "pyeon-ji-reul bo-nae-da"],
    ["택배를 보내다", "отправлять посылку", "taek-bae-reul bo-nae-da"],
    ["소포를 보내다", "отправлять бандероль", "so-po-reul bo-nae-da"],
    ["등기", "заказное (отправление)", "deung-gi"],
    ["국제 특급 우편(EMS)", "международная экспресс-почта (EMS)", "guk-je teuk-geup u-pyeon (EMS)"],
    ["주소", "адрес", "ju-so"],
    ["우표를 붙이다", "наклеивать марку", "u-pyo-reul bu-chi-da"],
    ["우편 번호", "почтовый индекс", "u-pyeon beon-ho"],
    ["편지 봉투", "конверт", "pyeon-ji bong-tu"],
    ["계좌를 개설하다(통장을 만들다)", "открывать банковский счёт", "gye-jwa-reul gae-seol-ha-da (tong-jang-eul man-deul-da)"],
    ["입금하다(돈을 넣다)", "вносить деньги", "ip-geum-ha-da (don-eul neo-ta)"],
    ["출금하다(돈을 찾다)", "снимать деньги", "chul-geum-ha-da (don-eul chat-da)"],
    ["돈을 바꾸다(환전하다)", "обменивать деньги", "don-eul ba-kku-da (hwan-jeon-ha-da)"],
    ["현금 자동 인출기(ATM)를 이용하다", "пользоваться банкоматом", "hyeon-geum ja-dong in-chul-gi (ATM)-reul i-yong-ha-da"],
    ["신용 카드/체크 카드를 만들다", "оформлять кредитную/дебетовую карту", "sin-yong ka-deu / che-keu ka-deu-reul man-deul-da"],
    ["공과금을 납부하다", "оплачивать коммунальные услуги", "gong-gwa-geum-eul nap-bu-ha-da"],
    ["돈을 보내다(송금하다)", "переводить деньги", "don-eul bo-nae-da (song-geum-ha-da)"],
    ["우편 업무", "почтовые услуги", "u-pyeon eop-mu"],
    ["은행 업무", "банковские услуги", "eun-haeng eop-mu"],
    ["금융", "финансы", "geum-yung"],
    ["예금", "вклад", "ye-geum"],
    ["보험", "страхование", "bo-heom"],
    ["업무 시간", "рабочее время", "eop-mu si-gan"],
    ["내용물", "содержимое", "nae-yong-mul"]
]

data14 = [
    ["구청", "районная администрация", "gu-cheong"],
    ["주민 센터", "центр для жителей", "ju-min sen-teo"],
    ["주소 변경 신고를 하다", "сообщать об изменении адреса", "ju-so byeon-gyeong sin-go-reul ha-da"],
    ["출생 신고를 하다", "регистрировать рождение", "chul-saeng sin-go-reul ha-da"],
    ["혼인 신고를 하다", "регистрировать брак", "hon-in sin-go-reul ha-da"],
    ["증명서를 받다", "получать свидетельство/справку", "jeung-myeong-seo-reul bat-da"],
    ["보건소", "медицинский центр", "bo-geon-so"],
    ["건강 검진을 받다", "проходить медосмотр", "geon-gang geom-jin-eul bat-da"],
    ["예방 주사를 맞다", "делать прививку", "ye-bang ju-sa-reul mat-da"],
    ["건강 진단서를 받다", "получать медицинское заключение", "geon-gang jin-dan-seo-reul bat-da"],
    ["외국인 등록증", "карта иностранца", "oe-gug-in deung-rok-jeung"],
    ["영주권", "вид на жительство", "yeong-ju-gwon"],
    ["국적 취득/귀화", "получение гражданства/натурализация", "guk-jeok chwi-deuk / gwi-hwa"],
    ["통합 신청서(신고서)", "единое заявление (уведомление)", "tong-hap sin-cheong-seo (sin-go-seo)"],
    ["외국인 등록", "регистрация иностранца", "oe-gug-in deung-rok"],
    ["등록증 재발급", "повторное получение карты", "deung-rok-jeung jae-bal-geup"],
    ["체류 기간 연장", "продление срока пребывания", "che-ryu gi-gan yeon-jang"],
    ["체류 자격 변경", "изменение статуса пребывания", "che-ryu ja-gyeok byeon-gyeong"],
    ["근무처", "место работы", "geun-mu-cheo"],
    ["체류지", "место проживания", "che-ryu-ji"],
    ["부여", "предоставление (прав, статуса)", "bu-yeo"],
    ["유효 기간", "срок действия", "yu-hyo gi-gan"],
    ["사업자 등록 번호", "регистрационный номер предпринимателя", "sa-eop-ja deung-rok beon-ho"],
    ["서명", "подпись", "seo-myeong"],
    ["인", "печать, штамп", "in"]
]

data15 = [
    ["서류", "документ", "seo-ryu"],
    ["명함", "визитная карточка", "myeong-ham"],
    ["사원증", "пропуск сотрудника", "sa-won-jeung"],
    ["복사기", "копировальный аппарат", "bok-sa-gi"],
    ["프린터", "принтер", "peu-rin-teo"],
    ["출근부", "табель учета рабочего времени", "chul-geun-bu"],
    #["안전모", "каска", "an-jeon-mo"],
    ["안전화", "защитная обувь", "an-jeon-hwa"],
    ["기계", "машина, механизм", "gi-gye"],
    ["공구", "инструмент", "gong-gu"],
    ["작성하다", "заполнять, составлять", "jak-seong-ha-da"],
    ["번역하다", "переводить (письменно)", "beon-yeok-ha-da"],
    ["출력하다", "распечатывать", "chul-ryeok-ha-da"],
    ["복사하다", "копировать", "bok-sa-ha-da"],
    ["팩스", "факс", "paek-seu"],
    # ["확인", "подтверждение", "hwak-in"],
    ["켜다", "включать", "kyeo-da"],
    ["끄다", "выключать", "kkeu-da"],
    ["들다", "поднимать", "deul-da"],
    ["올리다", "поднимать, загружать", "ol-li-da"],
    ["싣다", "грузить", "sit-da"],
    ["내리다", "опускать, выгружать", "nae-ri-da"],
    ["옮기다", "перемещать", "olm-gi-da"],
    ["통역하다", "переводить (устно)", "tong-yeok-ha-da"]
]

data16 = [
    ["포스터", "плакат, постер", "po-seu-teo"],
    ["축제", "фестиваль", "chuk-je"],
    ["대상", "приз, награда; объект", "dae-sang"],
    ["참가비", "взнос за участие", "cham-ga-bi"],
    ["준비물", "необходимые принадлежности", "jun-bi-mul"],
    ["문화 공연", "культурное представление", "mun-hwa gong-yeon"],
    ["체험거리", "мероприятие для опыта, активности", "che-heom-geo-ri"],
    ["오시는 길", "как добраться", "o-si-neun gil"],
    ["문의", "справка, вопрос", "mun-ui"],
    ["주최", "организатор", "ju-choe"],
    ["후원", "спонсорство", "hu-won"],
    ["게시판", "доска объявлений", "ge-si-pan"],
    ["주민 모임", "собрание жителей", "ju-min mo-im"],
    ["동호회", "клуб по интересам", "dong-ho-hoe"],
    ["회원", "участник, член", "hoe-won"],
    ["단수가 되다", "прекращаться (о водоснабжении)", "dan-su-ga doe-da"],
    ["뽑다", "выбирать, тянуть (жребий)", "ppop-da"],
    ["채용 공고", "объявление о приёме на работу", "chae-yong gong-go"],
    ["한가위", "Чхусок (другое название)", "han-ga-wi"],
    ["개최하다", "проводить (мероприятие)", "gae-choe-ha-da"],
    ["노래 대회", "песенный конкурс", "no-rae dae-hoe"],
    ["퀴즈 대회", "викторина", "kwi-jeu dae-hoe"],
    ["거주하다", "проживать", "geo-ju-ha-da"],
    ["참여하다", "участвовать", "cham-yeo-ha-da"],
    ["가능하다", "быть возможным", "ga-neung-ha-da"]
]

data17 = [
    ["잠을 충분히 자다", "спать достаточно", "jam-eul chung-bun-hi ja-da"],
    ["음식을 골고루 먹다", "есть разнообразную пищу", "eum-sik-eul gol-go-ru meok-da"],
    ["식사를 규칙적으로 하다", "питаться регулярно", "sik-sa-reul gyu-chik-jeok-eu-ro ha-da"],
    ["운동을 꾸준히 하다", "заниматься спортом регулярно", "un-dong-eul kku-jun-hi ha-da"],
    ["잠이 부족하다", "не высыпаться", "jam-i bu-jok-ha-da"],
    ["편식이 심하다", "сильно привередлив в еде", "pyeon-sik-i sim-ha-da"],
    ["식사가 불규칙하다", "питание нерегулярное", "sik-sa-ga bul-gyu-chik-ha-da"],
    ["운동을 거의 하지 않다", "почти не заниматься спортом", "un-dong-eul geo-i ha-ji an-da"],
    ["안색이 안 좋다", "плохо выглядеть (по лицу)", "an-saek-i an jo-ta"],
    ["힘(기운)이 없다", "нет сил", "him (gi-un)-i eop-da"],
    ["입맛이 없다", "нет аппетита", "ip-mat-i eop-da"],
    ["어지럽다", "кружится голова", "eo-ji-reop-da"],
    ["얼굴에 뭐가 나다", "появилось что-то на лице (сыпь)", "eol-gul-e mwo-ga na-da"],
    # ["열이 나다", "температура повысилась", "yeol-i na-da"],
    ["소화가 안 되다", "плохо переваривается", "so-hwa-ga an doe-da"],
    ["몸살이 나다", "озноб и ломота", "mom-sal-i na-da"],
    ["불면증", "бессонница", "bul-myeon-jeung"]
]

data18 = [
    ["요가", "йога", "yo-ga"],
    ["웰빙 댄스", "оздоровительный танец", "wel-bing daen-seu"],
    ["천연 비누", "натуральное мыло", "cheon-yeon bi-nu"],
    ["도자기", "керамика", "do-ja-gi"],
    ["어학", "изучение языка", "eo-hak"],
    ["자격증", "сертификат, лицензия", "ja-gyeok-jeung"],
    ["미용", "косметология", "mi-yong"],
    ["노래 교실", "класс пения", "no-rae gyo-sil"],
    ["음악 교실", "класс музыки", "eum-ak gyo-sil"],
    ["요리 교실", "кулинарный класс", "yo-ri gyo-sil"],
    ["인터넷으로 알아보다", "искать информацию в интернете", "in-teo-net-eu-ro al-a-bo-da"],
    ["프로그램을 선택하다", "выбирать программу", "peu-ro-geu-raem-eul seon-taek-ha-da"],
    ["시간을 확인하다", "проверять время", "si-gan-eul hwak-in-ha-da"],
    ["홈페이지", "веб-сайт", "hom-pe-i-ji"],
    ["회원 가입을 하다", "регистрироваться (становиться участником)", "hoe-won ga-ip-eul ha-da"],
    ["수강 신청을 하다", "записываться на курс", "su-gang sin-cheong-eul ha-da"],
    ["수강료를 결제하다", "оплачивать курс", "su-gang-ryo-reul gyeol-je-ha-da"],
    ["수업을 듣다", "посещать занятие", "su-eop-eul deut-da"],
    ["팸플릿", "брошюра", "paem-peul-lit"],
    ["도움이 되다", "приносить пользу", "do-um-i doe-da"],
    ["선착순", "в порядке живой очереди", "seon-chak-sun"],
    ["강좌", "лекция, курс", "gang-jwa"],
    ["접수", "регистрация (заявки)", "jeop-su"],
    ["별도", "отдельно", "byeol-do"],
    ["바리스타", "бариста", "ba-ri-seu-ta"]
]


def write(data, file, seen):
    for row in data:
        file.write("\"" + row[0] + "\"" + "," + "\"<b>" + row[1] + "</b> ["+row[2]+"]" + "\"" + "\n")
        file.write("\"" + row[1] + "\"" + "," + "\"<b>" + row[0] + "</b> ["+row[2]+"]" + "\"" + "\n")
        if row[0] in seen:
            raise ValueError(f"Duplicate line detected: {row[0].strip()}")
        if row[1] in seen:
            raise ValueError(f"Duplicate line detected: {row[1].strip()}")
        seen.add(row[0])
        seen.add(row[1])

csv_path = "output/KIIP2-RU.csv"
seen_lines = set()

with open(csv_path, "w", encoding="utf-8") as f:
    write(data1, f, seen_lines)
    write(data2, f, seen_lines)
    write(data3, f, seen_lines)
    write(data4, f, seen_lines)
    write(data5, f, seen_lines)
    write(data6, f, seen_lines)
    write(data7, f, seen_lines)
    write(data8, f, seen_lines)
    write(data9, f, seen_lines)
    write(data10, f, seen_lines)
    write(data11, f, seen_lines)
    write(data12, f, seen_lines)
    write(data13, f, seen_lines)
    write(data14, f, seen_lines)
    write(data15, f, seen_lines)
    write(data16, f, seen_lines)
    write(data17, f, seen_lines)
    write(data18, f, seen_lines)
    
csv_path