data1 = [
    ["오래되다", "быть старым, давним", "o-rae-doe-da"],
    ["호수", "озеро", "ho-su"],
    ["맥주", "пиво", "maek-jju"],
    ["벚꽃", "цветение вишни", "beot-kkot"],
    ["한강", "река Ханган", "han-gang"],
    ["해산물", "морепродукты", "hae-san-mul"],
    ["생선회", "сашими, сырая рыба", "saeng-seon-hoe"],
    ["절(사원)", "буддийский храм", "jeol (sa-won)"],
    ["박물관", "музей", "bang-mul-gwan"],
    ["건물", "здание", "geon-mul"],
    ["높다", "высокий", "nop-da"],
    ["많다", "много", "manh-da"],
    ["복잡하다", "сложный, запутанный", "bok-jjab-ha-da"],
    ["야경", "ночной пейзаж", "ya-gyeong"],
    ["아름답다", "красивый", "a-reum-dap-da"],
    ["교통", "транспорт", "gyo-tong"],
    ["편리하다", "удобный, практичный, функциональный", "pyeon-ri-ha-da"],
    ["한적하다", "спокойный, безлюдный", "han-jeok-ha-da"],
    ["깨끗하다", "чистый", "kkae-kkeut-ha-da"],
    ["조용하다", "тихий", "jo-yong-ha-da"],
    ["낮다", "низкий", "nat-da"],
    ["특히", "особенно", "teuk-hi"],
    ["관광지", "туристическое место", "gwan-gwang-ji"],
    ["섬", "остров", "seom"]
]

data2 = [
    ["청소하다", "убирать", "cheong-so-ha-da"],
    ["빨래하다", "стирать (бельё)", "ppal-lae-ha-da"],
    ["요리하다", "готовить (еду)", "yo-ri-ha-da"],
    ["책장을 정리하다", "наводить порядок на книжной полке", "chaek-jjang-eul jeong-ri-ha-da"],
    ["방을 치우다", "убирать комнату", "bang-eul chi-u-da"],
    ["방을 쓸다", "подметать комнату", "bang-eul sseul-da"],
    ["방을 닦다", "мыть комнату", "bang-eul dak-tta"],
    ["청소기를 돌리다", "пылесосить", "cheong-so-gi-reul dol-li-da"],
    ["쓰레기를 버리다", "выбрасывать мусор", "sseu-re-gi-reul beo-ri-da"],
    ["분리수거를 하다", "сортировать мусор", "bun-ri-su-geo-reul ha-da"],
    ["빨래를 널다", "развешивать бельё", "ppal-lae-reul neol-da"],
    ["빨래를 개다", "складывать бельё", "ppal-lae-reul kae-da"],
    ["세탁기를 돌리다", "включать стиральную машину", "se-tak-gi-reul dol-li-da"],
    ["다림질을 하다", "гладить", "da-rim-jil-eul ha-da"],
    ["손빨래를 하다", "стирать вручную", "son-ppal-lae-reul ha-da"],
    ["음식을 만들다", "готовить еду", "eum-sik-eul man-deul-da"],
    ["설거지하다", "мыть посуду", "seol-geo-ji-ha-da"],
    ["퇴근", "возвращение с работы", "toe-geun"],
    ["잊다", "забывать", "it-da"],
    ["장 보다", "ходить за покупками", "jang bo-da"],
    ["걸레질", "протирать (шваброй/тряпкой)", "geol-le-jil"],
    ["음식물 쓰레기", "пищевые отходы", "eum-sik-mul sseu-re-gi"],
    ["급한 일이 생기다", "возникло срочное дело", "geu-pan il-i saeng-gi-da"]
]

data3 = [
    ["쓰다", "носить (на голове, лице)", "sseu-da"],
    ["모자", "шапка, кепка", "mo-ja"],
    ["헬멧", "шлем", "hel-met"],
    ["안전모", "защитный шлем", "an-jeon-mo"],
    ["안경", "очки", "an-gyeong"],
    ["선글라스", "солнечные очки", "seon-geul-ra-seu"],
    ["신다", "надевать (на ноги)", "sin-da"],
    ["운동화", "кроссовки", "un-dong-hwa"],
    ["샌들", "сандалии", "saen-deul"],
    ["구두", "туфли", "gu-du"],
    ["부츠", "сапоги", "bu-cheu"],
    ["슬리퍼", "тапочки", "seul-li-peo"],
    ["작업화", "рабочая обувь", "ja-geop-hwa"],
    ["치수", "размер (одежды/обуви)", "chi-su"],
    ["잘 맞다", "хорошо сидеть", "jal mat-da"],
    ["굽이 높다", "высокий каблук", "gub-i nop-da"],
    ["입다", "надевать (одежду)", "ip-da"],
    ["티셔츠", "футболка", "ti-syeo-cheu"],
    ["청바지", "джинсы", "cheong-ba-ji"],
    ["셔츠", "рубашка", "syeo-cheu"],
    ["치마", "юбка", "chi-ma"],
    ["블라우스", "блузка", "beul-ra-u-seu"],
    ["원피스", "платье", "won-pi-seu"],
    ["코트", "пальто", "ko-teu"],
    ["점퍼", "куртка", "jeom-peo"],
    ["바지", "брюки", "ba-ji"],
    ["조끼", "жилет", "jo-kki"],
    ["하다", "носить (аксессуары)", "ha-da"],
    ["스카프", "шарф, платок", "seu-ka-peu"],
    ["귀걸이", "серьги", "gwi-geol-i"],
    ["목도리", "тёплый шарф", "mok-do-ri"],
    ["목걸이", "ожерелье", "mok-geol-i"],
    ["길이", "длина", "gil-i"],
    ["짧다", "короткий", "jjalb-da"],
    ["길다", "длинный", "gil-da"],
    ["편하다", "комфортный, спокойный, расслабляющий", "pyeon-ha-da"],
    ["마음에 들다", "нравиться", "ma-eum-e deul-da"],
    ["작업복", "рабочая одежда", "ja-geop-bok"],
    ["시원하다", "прохладный, освежающий", "si-won-ha-da"],
    ["땀", "пот", "ttam"],
    ["마르다", "сухой", "ma-reu-da"],
    ["주머니", "карман", "ju-meo-ni"]
]

data4 = [
    ["전화를 걸다", "звонить", "jeon-hwa-reul geol-da"],
    ["전화를 받다", "отвечать на звонок", "jeon-hwa-reul bat-da"],
    ["전화를 끊다", "положить трубку", "jeon-hwa-reul kkeun-ta"],
    ["문자를 보내다", "отправлять сообщение", "mun-ja-reul bo-nae-da"],
    ["문자를 받다", "получать сообщение", "mun-ja-reul bat-da"],
    ["문자를 지우다", "удалять сообщение", "mun-ja-reul ji-u-da"],
    ["전화를 바꾸다", "передать трубку", "jeon-hwa-reul ba-kku-da"],
    ["국제 전화를 하다", "звонить за границу", "guk-je jeon-hwa-reul ha-da"],
    ["영상 통화를 하다", "совершать видеозвонок", "yeong-sang tong-hwa-reul ha-da"],
    ["여보세요?", "алло?", "yeo-bo-se-yo?"],
    ["전화를 잘못 걸었어요", "я ошибся номером", "jeon-hwa-reul jal-mot geo-reo-sseo-yo"],
    ["통화 중이에요", "занято", "tong-hwa jung-i-e-yo"],
    ["매너 모드로 하세요 / 진동으로 하세요", "переведите в беззвучный / виброрежим", "mae-neo mo-deu-ro ha-se-yo / jin-dong-eu-ro ha-se-yo"],
    ["휴대 전화 배터리가 없어요", "у телефона разряжена батарея", "hyu-dae jeon-hwa bae-te-ri-ga eop-seo-yo"],
    ["답장이 없어요", "нет ответа", "dap-jang-i eop-seo-yo"],
    ["전화번호가 몇 번이에요?", "какой номер телефона?", "jeon-hwa-beon-ho-ga myeot beo-ni-e-yo?"],
    ["전화 왔어요", "был звонок", "jeon-hwa wat-seo-yo"],
    ["지금 안 계세요", "сейчас его/её нет", "ji-geum an gye-se-yo"],
    ["혹시", "возможно, вдруг", "hok-ssi"],
    ["걱정이 되다", "начинать волноваться", "geok-jeong-i doe-da"],
    ["구경하다", "осматривать, смотреть", "gu-gyeong-ha-da"],
    ["시험 범위", "объём экзамена", "si-heom beom-wi"]
]

data5 = [
    ["열이 나다", "поднимается температура", "yeol-i na-da"],
    ["콧물이 나다", "течёт из носа", "kon-mul-i na-da"],
    ["머리가 아프다", "болит голова", "meo-ri-ga a-peu-da"],
    ["기침을 하다", "кашлять", "gi-chim-eul ha-da"],
    ["이가 아프다", "болит зуб", "i-ga a-peu-da"],
    ["목이 붓다", "опухло горло", "mo-gi but-da"],
    ["배가 아프다", "болит живот", "bae-ga a-peu-da"],
    ["설사를 하다", "понос", "seol-sa-reul ha-da"],
    ["부러지다", "сломаться (кость)", "bu-reo-ji-da"],
    ["다치다", "пораниться", "da-chi-da"],
    ["해열제", "жаропонижающее", "hae-yeol-je"],
    ["두통약", "таблетки от головы", "du-tong-yak"],
    ["감기약", "лекарство от простуды", "gam-gi-yak"],
    ["소화제", "лекарство для пищеварения", "so-hwa-je"],
    ["파스", "пластырь (разогревающий)", "pa-seu"],
    ["밴드", "лейкопластырь", "baen-deu"],
    ["붙이다", "приклеивать", "bu-chi-da"],
    ["소독약", "антисептик", "so-dok-yak"],
    ["연고", "мазь", "yeon-go"],
    ["바르다", "мазать", "ba-reu-da"],
    ["용법", "способ применения", "yong-beop"],
    ["회", "раз (приём лекарства)", "hoe"],
    ["분", "разделение (доза)", "bun"],
    ["식전", "до еды", "sik-jeon"],
    ["식후", "после еды", "sik-hu"],
    ["댓글", "комментарий", "daet-geul"]
]

data6 = [
    ["기분이 좋다", "настроение хорошее", "gi-bun-i jo-ta"],
    ["기쁘다", "радостный", "gi-ppeu-da"],
    ["행복하다", "счастливый", "haeng-bok-ha-da"],
    ["신나다", "в восторге", "sin-na-da"],
    ["반갑다", "приятно, радостно (встретиться)", "ban-gap-da"],
    ["즐겁다", "весёлый, радостный", "jeul-geop-da"],
    ["기분이 안 좋다", "настроение плохое", "gi-bun-i an jo-ta"],
    ["슬프다", "грустный", "seul-peu-da"],
    ["외롭다", "одинокий", "oe-rop-da"],
    ["화나다", "злиться", "hwa-na-da"],
    ["걱정되다", "волноваться", "geok-jeong-doe-da"],
    ["짜증나다", "раздражаться", "jja-jeung-na-da"],
    ["답답하다", "тяжело на душе / душно", "dap-dap-ha-da"]
]

def write(data, file, seen):
    for row in data:
        file.write("\"" + row[0] + "\"" + "," + "\"<b>" + row[1] + "</b> ["+row[2]+"]" + "\"" + "\n")
        file.write("\"" + row[1] + "\"" + "," + "\"<b>" + row[0] + "</b> ["+row[2]+"]" + "\"" + "\n")
        if row[0] in seen:
            raise ValueError(f"Duplicate line detected: {row[0].strip()}")
        if row[1] in seen:
            raise ValueError(f"Duplicate line detected: {row[1].strip()}")
        seen.add(row[0])
        seen.add(row[1])

csv_path = "output/KIIP2-RU.csv"
seen_lines = set()

with open(csv_path, "w", encoding="utf-8") as f:
    write(data1, f, seen_lines)
    write(data2, f, seen_lines)
    write(data3, f, seen_lines)
    write(data4, f, seen_lines)
    write(data5, f, seen_lines)
    write(data6, f, seen_lines)
    
csv_path